package basic;

import java.util.Arrays;

public class 오늘의도전 {
//	"""
//	정렬문제 
//
//	    2차원배열 정렬이며, 정렬기준은  일차원배열 하나하나가 정렬기준이다.
//	    아래 3가지 조건을 전부 충족해야한다.
//	    
//
//	    [1] 앞글자 하나의 기준으로 오름차순하면된다. 
//	    [
//	        [5,3]
//	        [2,9]
//	        [3,8]
//	    ]
//	    정렬후
//	    [
//	        [2,9]
//	        [3,8]
//	        [5,3]
//	    ]
//	    -------------------------------------
//	    [2] 앞글자가 같은경우 다음글자를 비교한다.
//	    [
//	        [5,3]
//	        [5,1]
//	        [2,8]
//	    ]
//	    정렬후
//	    [
//	        [2,8]
//	        [5,1]
//	        [5,3]
//	    ]
//	    -------------------------------------
//	    [3] 길이가 다른경우 (각글자를 비교후 짧은배열이 위로올라간다.)
//	    [
//	        [5,7,2]
//	        [5,7]
//	        [1,5,6,45,6]
//	    ]
//	    정렬후
//	    [
//	        [1,5,6,45,6]
//	        [5,7]
//	        [5,7,2]
//	    ]
//
//	"""
//
//	"""
//	[최종문제] 위 규칙을 가지고 아래 배열을 정렬하시오.
//
//	    [
//	        [6,5,4,5,5,8],
//	        [6,5,6],
//	        [6,5,4,5,5],
//	        [3,4,5,8,9,3,3,3]
//	        [9],
//	        [1,4,7]
//	    ]
//	    정렬후
//	    [
//	        [1,4,7]
//	        [3,4,5,8,9,3,3,3]
//	        [6,5,4,5,5],
//	        [6,5,4,5,5,8],
//	        [6,5,6],
//	        [9],
//	    ]
//
//	"""
	
	int[][] 배열정렬(int[][] a){
		
		int k=0;
		for(int i=0;i<a.length;i++) {
			System.out.println(i);
			for(int j=i;j<a.length;j++) {
				if(k==a[i].length-1||k==a[j].length-1) {k=0;break;}
				if(a[i][k]>a[j][k]) {
					int []temp=new int [a[i].length];
					temp=a[i];
					a[i]=a[j];
					a[j]=temp;
					
					System.out.println(k);
					
					
				}
				else if(a[i][k]==a[j][k]) {
					k++;j--;
				}
				
				
				
				
			}
			
			
		}
		return a;
	}
	

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
		

		int [][]arr= {{6,5,4,5,5,8},
				{6,5,6},
				{6,5,4,5,5},
				{3,4,5,8,9,3,3,3},
				{9},
				{1,4,7}};
//		int[][]arr= {
//				{3},
//				{4},
//				{7},
//				{9},
//				{6},
//				{1},
//				{8},
//				{5},
//				
//				{2}
//				
//		};
		오늘의도전 a=new 오늘의도전();
		arr=a.배열정렬(arr);
		for(int i=0;i<arr.length;i++) {
			System.out.println(Arrays.toString(arr[i]));
		}
		
		}
		

}

